Revit 2027 API
OverrideGraphicSettings.IsSurfaceForegroundPatternVisible Property
 The visibility of the surface foreground fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSurfaceForegroundPatternVisible { get; }
Public ReadOnly Property IsSurfaceForegroundPatternVisible As Boolean
	Get
public:
property bool IsSurfaceForegroundPatternVisible {
	bool get ();
}
member IsSurfaceForegroundPatternVisible : bool with get
Property Value
Boolean
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace